app/controllers/password_resets_controller.rb

  def update
    if params[:user][:password].empty?
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$CLFid5hN6vzDMidNMzIq8uwu1H/rGgx7FS26MCzjaRCUlQ3jgScgi"], ["updated_at", "2019-03-10 19:42:45.926230"], ["id", 104]]