app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params) # user_paramaters is a strong parameter hash of submitted data
    if @user.save